[
  {
    "id": 1,
    "title": "The Beauty of Mathematics",
    "date": "2025-10-29",
    "excerpt": "Mathematic is a language of pure abstraction to filter the essence of the nature.",
    "readingTime": "10 min",
    "category": "Philosophy of Science",
    "featured": false,
    "cover": "assets/posts_maths.jpg",
    "html": "<p>In this essay I examine how mathematic is all around and can model and predict part of the reality. But what is reality ?</p>"
  },
  {
    "id": 2,
    "title": "Models, Measurement, and Meaning",
    "date": "2025-10-01",
    "excerpt": "Why the choice of model is an epistemic act, not a technicality.",
    "readingTime": "6 min",
    "category": "Philosophy of Science",
    "featured": false,
    "cover": "assets/posts_meaning.jpg",
    "html": "<p>In this essay I examine how measurement frameworks encode assumptions that later appear as results. We survey historical cases and propose a simple checklist for future work.</p>"
  },
  {
    "id": 3,
    "title": "Nuclear Systems: Safety as a Property of Design",
    "date": "2025-09-15",
    "excerpt": "Safety isn’t a bolt-on step; it’s a design invariant with feedback loops.",
    "readingTime": "7 min",
    "category": "Nuclear Engineering",
    "cover": "assets/posts_nuke.jpg",
    "html": "<p>Design choices define safety envelopes long before operations. I outline a practical pattern language for systems work.</p>",
    "featured": false
  },
  {
    "id": "4",
    "date": "2025-10-30",
    "title": "Strengths and Limits of ChatGPT",
    "excerpt": "ChatGPT represents a major step forward in human–AI interaction. Its ability to generate coherent, context-aware, and creative responses has transformed how people write, learn, and program.\nBelow are its main strengths and key limits.",
    "readingTime": "",
    "category": "Philosophie des sciences",
    "cover": "assets/posts_ai.jpg",
    "featured": false,
    "html": "<p><strong>Strengths and Limits of ChatGPT</strong></p>\n\n<p>ChatGPT represents a major step forward in human–AI interaction. Its ability to generate coherent, context-aware, and creative responses has transformed how people write, learn, and program. Below are its <em>main strengths</em> and <em>key limits</em>.</p>\n\n<p><strong>Strengths</strong></p>\n<p>1) <strong>Versatility</strong> — ChatGPT can assist with a wide range of tasks: writing, translation, coding, summarization, brainstorming, and technical explanations.</p>\n<p>2) <strong>Contextual reasoning</strong> — It can maintain context across long conversations, enabling continuity of ideas and refinement of complex projects.</p>\n<p>3) <strong>Speed and productivity</strong> — It delivers structured, well-formatted content quickly, accelerating research and development.</p>\n<p>4) <strong>Accessibility of knowledge</strong> — It democratizes access to advanced concepts, from philosophy to nuclear engineering.</p>\n<p>5) <strong>Multilingual and adaptable</strong> — It writes in many languages and adapts tone and complexity to the user’s intent.</p>\n\n<p><strong>Limits</strong></p>\n<p>1) <strong>No true understanding</strong> — ChatGPT does not “know”; it predicts text patterns. Reasoning can appear logical without genuine comprehension.</p>\n<p>2) <strong>Dependence on input clarity</strong> — Ambiguous questions lead to inconsistent results; precise prompts matter.</p>\n<p>3) <strong>Limited factual reliability</strong> — Without live web access, it may provide outdated or incorrect information.</p>\n<p>4) <strong>No autonomy or verification</strong> — It cannot fact-check experimentally or validate outputs beyond text.</p>\n<p>5) <strong>Ethical and privacy constraints</strong> — It avoids sensitive content, limiting certain analyses.</p>\n\n<p><strong>Conclusion</strong></p>\n<p>ChatGPT excels as an <em>assistant</em>, not an <em>authority</em>. It augments human thinking—offering clarity, speed, and creativity—while relying on human judgment to ensure accuracy, ethics, and critical interpretation.</p>"
  },
  {
    "id": "5",
    "date": "2025-10-30",
    "title": "Actual Darkness: Democracy Under Strain",
    "excerpt": "Polarization, misinformation, and authoritarian rhetoric are casting a shadow over democratic societies.",
    "readingTime": "",
    "category": "",
    "cover": "assets/posts_democracy.jpg",
    "featured": true,
    "html": "<p><strong>Actual Darkness: Democracy Under Strain</strong></p>\n<p>Across many countries, the public square feels darker: institutions are pressured, facts are contested, and outrage competes with reason. Charismatic strongmen and right-wing extremist currents amplify fear and grievance, promising order while undermining the checks and balances that keep power accountable. In the U.S., the Trump era and its aftermath became a catalyst for deeper polarization, culture-war governance, and escalating threats against journalists, judges, and public servants. Globally, similar movements exploit economic anxiety and distrust to normalize illiberal ideas once confined to the fringe.</p>\n<p>This darkness thrives on three engines. First, <em>narrative warfare</em>: high-reach media and algorithmic feeds reward sensationalism, drowning out nuance and evidence. Second, <em>institutional abrasion</em>: leaders test red lines—intimidating election officials, politicizing the civil service, and attacking the independence of courts—until yesterday’s breach becomes today’s baseline. Third, <em>movement laundering</em>: extremist rhetoric is mainstreamed via euphemisms and “just asking questions,” eroding taboos against dehumanization and political violence.</p>\n<p>Yet fatalism is a trap. The antidote is practical: defend electoral integrity and peaceful transfer of power; protect independent judiciaries and professional, nonpartisan administration; harden the information ecosystem with transparency rules for platforms and clear consequences for coordinated disinformation; invest in civic education, local journalism, and community-level violence prevention; and rebuild broad, cross-party commitments to the simple proposition that opponents are fellow citizens, not enemies.</p>\n<p>Democracy’s light is not self-sustaining; it’s maintained—by laws that constrain the mighty, by media that verify before they amplify, and by citizens who refuse the seduction of cruelty disguised as strength. The work now is patient and forward-looking: reinforce institutions, reduce the incentives for extremism, and preserve a civic culture where facts matter and power answers to the people.</p>"
  }
]